app/Controllers/BarangController.php

                    'jenis_barang' => $this->request->getVar('jenis_barang'),
                ];
                $barang = new BarangModel();
                $barang->insert($save);
---
INSERT INTO `barang` (`kode_barang`, `nama_barang`, `jenis_barang`, `created_at`, `updated_at`) VALUES ('BAR00003', 'Tinta Epson 003 Yellow', 'Jadi', '2023-07-11 08:23:26', '2023-07-11 08:23:26')