app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
---
    public function readSupplier()
    {
        if ($this->request->isAJAX()) {
            $SupplierModel = new \App\Models\SupplierModel();
            $data = [
                'title' => 'Data Supplier',
                'suppliers' => $SupplierModel->findAll()
            ];